"""
案例:
    演示张量的索引操作

分类:
    简单行列索引
    列表索引
    范围索引
    布尔索引
    多维索引

"""

#导包
import torch

#设置随机种子
torch.manual_seed(1)

#创建随机张量
t1 = torch.randint(1,100,(6,5))
print(f"t1:{t1}")
print('==' * 30)

#1.简单行列索引
print(t1[1])
print(t1[1,:])
print(t1[2,:])
print('==' * 30)

#2.列表索引
print(f"(0,1) = {t1[0,1]},(1,2) = {t1[1,2]}")#返回(0,1)和(1,2)两个位置的元素
print(t1[[1,3],[2,4]])#返回(1,2),(3,4)位置的元素
print(t1[[[0],[1]],[1,2]])#返回在0,1行和1,2列的4个元素
print('==' * 30)

#3.范围索引
print(t1[:3,:2])#前三行,前两列的元素
print(t1[1:,:2])#第二行到最后一行,前两列的元素
print(t1[1::2,0::2])#奇数行,偶数列
print('==' * 30)

#4.布尔索引
print(t1[t1[:,2]>50,2]) #第三列所有大于50的元素
print(t1[1,t1[1,:]>20]) #第二行所有大于20的元素
print('==' * 30)

#5.多维索引
t2 = torch.randint(1,10,(2,3,4))#三维张量
print(f"t2:{t2}")

#需求1：获取0轴上的第一个数据
print(t2[0,:,:])
#需求2：获取1轴上的第一个数据
print(t2[:,0,:])
#需求3：获取2轴上的第一个数据
print(t2[:,:,0])